# Group by

the groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['sam','char','amy','asd','fas','sad'],
      'Sales':[200,120,340,124,243,350]
     }

In [2]:
df=pd.DataFrame(data)

In [3]:
df

  Company Person  Sales
0    GOOG    sam    200
1    GOOG   char    120
2    MSFT    amy    340
3    MSFT    asd    124
4      FB    fas    243
5      FB    sad    350

you can use the .groupby() method to group rowa together based off of a column name. For instance lets group beased off of company. this will create a DataFrameGroupBu object:

In [4]:
df.groupby('Company')

In [5]:
by_company= df.groupby('Company') #save the object as new variable

In [6]:
by_company.mean()

C:\Users\USER\AppData\Local\Temp\ipykernel_16132\2992551274.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [7]:
df.groupby('Company').mean() #also you can write

C:\Users\USER\AppData\Local\Temp\ipykernel_16132\910704006.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean() #also you can write

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
by_company.std() #standard deviation

C:\Users\USER\AppData\Local\Temp\ipykernel_16132\3751604006.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.std() #standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [9]:
by_company.min()

        Person  Sales
Company
FB         fas    243
GOOG      char    120
MSFT       amy    124

In [10]:
by_company.max()

        Person  Sales
Company
FB         sad    350
GOOG       sam    200
MSFT       asd    340

In [11]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [12]:
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [13]:
by_company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [14]:
by_company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64